{"rooms": {"Entrance_Hall": {"Description": "As you step into the Entrance Hall, a gust of cold air greets you—either the castle is saying hello or it’s just really, really old. \nThe torches flicker like they know something you don’t, and the shadows on the walls? Yeah, they’re probably up to no good.", "Exits": ["Left_Corridor(West)", "Right_Corridor(East)", "Grand_Staircase(North)"], "Movements": ["West", "East", "North"], "Items": ["feather"], "Locked": false}, "Left_Corridor": {"Description": "Entering the left corridor, you feel a chill run down your spine—what secrets lie ahead in the darkness? Something feels \nwrong in this part of the castle. ", "Movements": ["East", "West"], "Exits": ["Entrance_Hall(East)", "Crypt(West)"], "Items": ["anvil"], "Locked": false}, "Right_Corridor": {"Description": "The corridor feels damp, with faded tapestries hanging along the stone walls. The ground beneath your feet is uneven, and the sound of clanking metal echoes \nfaintly, coming from deeper within the castle. The passage seems to stretch into darkness. ", "Movements": ["West", "East"], "Exits": ["Entrance_Hall(West)", "Armory(East)"], "Items": ["stone"], "Locked": false}, "Crypt": {"Description": "You step into the cold, silent Crypt. The air is thick, and the stone \"coffins\" that line the walls look ancient, untouched for centuries. \nCarvings of strange symbols are etched into the stone, hinting at long-forgotten secrets. You sense something valuable might \nbe hidden here, but it won’t reveal itself easily.", "Movements": ["East", "South"], "Exits": ["Left_Corridor(East)", "Library(South)"], "Items": [], "Puzzle Reward": ["golden key"], "Locked": false, "coffins": "Five weathered coffins stand before you, each one guarded by a ghostly figure. An inscription above the coffins whispers:\n\"Only by solving the riddles of the guardians can you find the treasure hidden within these coffins.\"\nYou can choose to approach any coffin and attempt to solve the riddle posed by its guardian.", "Puzzle_Help": "If your answer is correct,the guardian will allow you to move to the next coffin, \nrevealing its puzzle. Solve all five puzzles to reveal the treasure!\n", "Puzzle": {"1": {"Riddle": "Coffin 1: Guardian: \"I can be cracked, made, told, and played. What am I?\"", "Answer": "A Joke jokes", "Solved": false}, "2": {"Riddle": "Coffin 2: Guardian: \"The more you take, the more you leave behind. What am I?\"", "Answer": "Footsteps footstep", "Solved": false}, "3": {"Riddle": "Coffin 3: Guardian: \"I am a friend of time. What am I?\"", "Answer": "A Clock clocks", "Solved": false}, "4": {"Riddle": "Coffin 4: Guardian: \"I linger in dreams. What am I?\"", "Answer": "A memory memories", "Solved": false}, "5": {"Riddle": "Coffin 5: Guardian: \"I guard the past. What am I?\"", "Answer": "A tombstone tombstones", "Solved": false}}}, "Armory": {"Description": "Ancient suits of armor, now rusted and broken, line the walls. Broken weapons are strewn across the floor, and a heavy shield with an inscription stands \nupright at the far end.There's a riddle carved onto the shield, which might unlock something valuable.", "Movements": ["West", "South"], "Exits": ["Right_Corridor(West)", "Servant_Quarters(South)"], "Items": [], "Puzzle Reward": ["bronze key"], "Locked": false, "Puzzle_Help": "To unlock the secrets within, you must recall the powerful words you discovered in the library. Combine the letters with their corresponding numbers to form \nthree 5-digit codes.\nA=3\nB=5\nC=2\nD=9\nE=1\nL=8\nN=6\nO=4\nR=7\nS=2\nW=0\nYou must now enter the 5-digit codes for the three words, one at a time", "Puzzle": {"1": {"Riddle": "Recall the first code... ", "Answer": "58391", "Solved": false}, "2": {"Riddle": "Recall the second code... ", "Answer": "27406", "Solved": false}, "3": {"Riddle": "Recall the third code...", "Answer": "20479", "Solved": false}}}, "Grand_Staircase": {"Description": "Before you lies the Grand Staircase, its imposing steps creaking beneath your feet like the whispers of long-lost souls! Ascend if you dare, \nbut beware—the sound of your footsteps may awaken secrets best left undisturbed!", "Movements": ["South", "North"], "Exits": ["Entrance_Hall(South)", "Grand_Ballroom(North)"], "Items": ["skull"], "Locked": false}, "Grand_Ballroom": {"Description": "This once grand and opulent room is now faded, with tattered curtains and dusty chandeliers swaying slightly as if from a breeze you can’t feel. In the \ncorner of the room are some scattered ancient \"murals\" here.Something appears to be written on the \"wall\"", "wall": "\nThe ballroom has an inscription on the wall that reads:\n\"Only by stepping in the rhythm of the stars shall the door to the past open. Solve the puzzle to unlock its secrets.\"", "Movements": ["South", "North"], "Exits": ["Grand_Staircase(South)", "Tower_Room(North)"], "Items": ["murals"], "Puzzle Reward": ["silver key"], "Locked": false, "Puzzle_Help": "You face the worn ballroom floor. Nine tiles lie before you, each engraved with a star. \nStep in the rhythm of the stars to get the key.\n1 | 2 | 3\n---------\n4 | 5 | 6\n---------\n7 | 8 | 9\nEnter coordinates like \"1,1\" or \"2,3\" (Hint: 5 coordinates make a pattern)\n", "Puzzle": {"1": {"Riddle": "Where will you step first?", "Answer": "1,1 1,3 3,1 3,3 2,2", "Solved": false}, "2": {"Riddle": "Where will you step next?", "Answer": "1,1 1,3 3,1 3,3 2,2", "Solved": false}, "3": {"Riddle": "Where will you step next?", "Answer": "1,1 1,3 3,1 3,3 2,2", "Solved": false}, "4": {"Riddle": "Where will you step next?", "Answer": "1,1 1,3 3,1 3,3 2,2", "Solved": false}, "5": {"Riddle": "Where will you step next?", "Answer": "1,1 1,3 3,1 3,3 2,2", "Solved": false}}}, "Servant_Quarters": {"Description": "As you enter the dimly lit servant quarters, a faint voice echoes from a dark corner. You approach and notice a shadowy figure with no body, just a floating head \n— his name is \"Bodyless.\" Enter \"interact\" to interact with this creature.", "Movements": ["North", "West"], "Exits": ["Armory(North)", "Dungeon(West)"], "Items": ["lamp"], "Locked": true, "Unlocked_By": ["bronze key"], "Puzzle Reward": ["castle map"], "Puzzle_Help": "BODYLESS:\nNothing in this castle comes for free, especially not from me. You must prove your wit to earn the key. Solve this, and the prize is yours. \nFail, and you’ll remain here, wondering what could have been. (Bodyless gives a wicked laugh)\n", "Puzzle": {"0": {"Riddle": "Listen closely, adventurer:\nI speak without a mouth and hear without ears. I have no body, but I come alive with wind. What am I?", "Answer": "an echo a echo echoes", "Solved": false}}}, "Dungeon": {"Description": "As you descend into the dungeon, a chill envelops you, and the air is thick with an earthy smell. The flickering torches cast dancing shadows\n along the stone walls. Ahead, you see a dimly lit chamber where five pressure plates are arranged in a line, each etched with a different symbol. \nMaybe some sort of puzzle...", "Movements": ["East", "South", "West"], "Exits": ["Servant_Quarters(East)", "Hidden_Chamber(South)"], "Items": ["goblet"], "Puzzle Reward": ["blood moon key"], "Locked": true, "Unlocked_By": ["cell key"], "Puzzle_Help": "In the center of the chamber lie five pressure plates, each marked with a distinct symbol: \nan anvil, \na feather, \na stone, \na goblet, and a \nskull. \nYou notice a nearby inscription that reads:\"\nPlace the mentioned items upon the plates to unlock the secrets of the dungeon.\"\nThese items maybe present in different rooms across the castle. (Eg type \"use anvil\" to use anvil)", "Puzzle": {"1": {"Riddle": "Anvil (Heavy)", "Answer": true, "Solved": false}, "2": {"Riddle": "Feather (Light)", "Answer": true, "Solved": false}, "3": {"Riddle": "Stone (Medium)", "Answer": true, "Solved": false}, "4": {"Riddle": "Goblet (Medium)", "Answer": true, "Solved": false}, "5": {"Riddle": "Skull (Heavy)", "Answer": true, "Solved": false}}}, "Library": {"Description": "Rows of ancient, dust-covered books line the shelves. The room smells of old paper and knowledge long forgotten. A small ladder leans against one of the \nshelves, and a particular \"book\" looks out of place, almost as if it has been moved recently.", "Movements": ["North"], "Exits": ["Crypt(North)"], "Items": ["book"], "Locked": true, "Unlocked_By": ["golden key"]}, "Tower_Room": {"Description": "The highest point of the castle, the Tower Room is small but offers a breathtaking view of the surrounding lands through a large, old \"telescope\". Dusty scrolls \nand strange \"artifacts\" are scattered about the room, and you sense that something important is hidden here.", "telescope": "The telescope is old and covered in a thick layer of dust. Wiping it clean, you notice the lens is still intact, though a bit cloudy from years of neglect. \nIt seems to point toward something beyond the castle walls, but it's hard to make out clearly.", "artifacts": "The artifacts are strange and foreign. One is a small, intricately carved stone that catches your eye. \nWhen you pick it up, a hidden mechanism clicks, and the stone shifts in your hand. Looks like some sort of puzzle to you.", "Movements": ["South"], "Exits": ["Grand_Ballroom(South)"], "Items": [], "Puzzle Reward": ["cell key"], "Locked": true, "Unlocked_By": ["silver key"], "Puzzle_Help": "The carved stone seems to be part of a hidden mechanism. If you rotate it correctly, something might happen.", "Puzzle": {"1": {"Riddle": "Rotate the stone (Type rotate) ", "Answer": "rotate rotates", "Solved": false}, "2": {"Riddle": "Still no luck.. maybe rotate the stone again?", "Answer": "rotate rotates", "Solved": false}, "3": {"Riddle": "I think you are getting closer. Try to rotate it again.", "Answer": "rotate rotates", "Solved": false}, "4": {"Riddle": "Many have given up before you.. Want to give it another try?", "Answer": "rotate rotates", "Solved": false}}}, "Hidden_Chamber": {"Description": "The hidden chamber contains a sleeping \"dragon\" that guards the key. To retrieve it, you must engage the dragon in a mental duel rather than a physical fight. \nThe dragon challenges you with a task, which  will test different skills like logic, memory, and quick thinking. Failing to accomplish any task will have \nserious consequences and you might loose all your progress. (Type \"interact\" to interact with the dragon)", "Movements": ["North", "South"], "Exits": ["Dungeon(North)", "Final_Exit(South)"], "Items": [], "Locked": true, "Unlocked_By": ["blood moon key"], "Puzzle Reward": ["eternity key"]}, "Final_Exit": {"Description": "As you turn the key and the ancient door creaks open, a wave of fresh air rushes in. You’ve triumphed over darkness and deception. With each step into the light, \nyou carry the stories of the castle and the promise of new adventures ahead.", "Locked": true, "Unlocked_By": ["eternity key"], "Items": [], "Movements": ["North"], "Exits": ["Hidden_Chamber(North)"]}}}